#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/whip-up/csharp-clean-architecture-github-action/runs/run-UZz5yvhFgeqMw59u

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:467945566648:cluster/clean-slice-cluster]
aws_iam_role_policy.task: Refreshing state... [id=terraform-20230427135024309700000002:terraform-20230427135024933600000004]
aws_cloudwatch_log_group.task: Refreshing state... [id=clean-slice-production]
data.aws_vpc.this: Refreshing...
data.aws_caller_identity.current: Refreshing...
aws_iam_role.task: Refreshing state... [id=terraform-20230427135024309700000002]
data.aws_region.current: Refreshing...
aws_ecr_repository.dot-net-architecture: Refreshing state... [id=clean-slice]
data.aws_region.current: Refresh complete after 0s [id=ap-southeast-2]
aws_iam_role_policy_attachment.task[0]: Refreshing state... [id=terraform-20230427135024309700000002-20230427135025049600000005]
aws_ecs_task_definition.initiator: Refreshing state... [id=clean-slice-task]
data.aws_caller_identity.current: Refresh complete after 0s [id=467945566648]
data.aws_vpc.this: Refresh complete after 2s [id=vpc-d23709b5]
data.aws_subnets.this: Refreshing...
aws_security_group.this: Refreshing state... [id=sg-0e1ef5e8e637d4a4f]
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:targetgroup/clean-slice-lb-tg/a08d81c514673f11]
data.aws_subnets.this: Refresh complete after 0s [id=ap-southeast-2]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:loadbalancer/app/clean-slice-alb/0d8a0f9701063a6c]
aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:listener/app/clean-slice-alb/0d8a0f9701063a6c/c9d5eeafad5c649b]
aws_lb_listener_rule.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:listener-rule/app/clean-slice-alb/0d8a0f9701063a6c/c9d5eeafad5c649b/5a284721b4302296]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:467945566648:service/clean-slice-cluster/clean-slice]
aws_ecs_task_definition.initiator: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.task will be destroyed
  # (because aws_cloudwatch_log_group.task is not in configuration)
  - resource "aws_cloudwatch_log_group" "task" {
      - arn               = "arn:aws:logs:ap-southeast-2:467945566648:log-group:clean-slice-production" -> null
      - id                = "clean-slice-production" -> null
      - name              = "clean-slice-production" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Environment" = "Production"
          - "Service"     = "clean-slice"
        } -> null
    }

  # aws_ecs_task_definition.initiator must be replaced
-/+ resource "aws_ecs_task_definition" "initiator" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-2:467945566648:task-definition/clean-slice-task:6" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - command          = [
                      - "/bin/sh -c \"echo '<html> <head> <title>Temporary page</title> <style>body {margin-top: 40px; background-color: #333;} </style> </head><body> <div style=color:white;text-align:center> <h2>Congratulations!</h2> <p>Now ready for CICD.</p> </div></body></html>' >  /usr/local/apache2/htdocs/index.html && httpd-foreground\"",
                    ]
                  - cpu              = 0
                  - entryPoint       = [
                      - "sh",
                      - "-c",
                    ]
                  - environment      = []
                  ~ image            = "httpd:2.4" -> "nginxdemos/nginx-hello:0.2"
                  - mountPoints      = []
                    name             = "clean-slice"
                  ~ portMappings     = [
                      ~ {
                          ~ containerPort = 80 -> 8080
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom      = []
                    # (2 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ cpu                      = "256" -> "1" # forces replacement
      ~ execution_role_arn       = "arn:aws:iam::467945566648:role/terraform-20230427135024309700000002" # forces replacement -> (known after apply) # forces replacement
      ~ id                       = "clean-slice-task" -> (known after apply)
      ~ memory                   = "512" -> "256" # forces replacement
      ~ revision                 = 6 -> (known after apply)
      - tags                     = {} -> null
      - task_role_arn            = "arn:aws:iam::467945566648:role/terraform-20230427135024309700000002" -> null # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.task will be destroyed
  # (because aws_iam_role.task is not in configuration)
  - resource "aws_iam_role" "task" {
      - arn                   = "arn:aws:iam::467945566648:role/terraform-20230427135024309700000002" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = "AssumeRoleECS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-04-27T13:50:24Z" -> null
      - force_detach_policies = false -> null
      - id                    = "terraform-20230427135024309700000002" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "terraform-20230427135024309700000002" -> null
      - name_prefix           = "terraform-" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment" = "Production"
          - "Service"     = "clean-slice"
        } -> null
      - unique_id             = "AROAWZ452WG4FGNLAY3QY" -> null

      - inline_policy {
          - name   = "terraform-20230427135024933600000004" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                              - "logs:DeleteLogGroup",
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvent",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.task_execution will be created
  + resource "aws_iam_role" "task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecutionAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "Production"
          + "Service"     = "clean-slice"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.task will be destroyed
  # (because aws_iam_role_policy.task is not in configuration)
  - resource "aws_iam_role_policy" "task" {
      - id     = "terraform-20230427135024309700000002:terraform-20230427135024933600000004" -> null
      - name   = "terraform-20230427135024933600000004" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:DeleteLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvent",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "terraform-20230427135024309700000002" -> null
    }

  # aws_iam_role_policy_attachment.task[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "task" {
      ~ id         = "terraform-20230427135024309700000002-20230427135025049600000005" -> (known after apply)
      ~ role       = "terraform-20230427135024309700000002" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  + aws_ecs_init_task_definition_arn = (known after apply)
  + iam_execution_task_arn           = (known after apply)
  - iam_task_arn                     = "arn:aws:iam::467945566648:role/terraform-20230427135024309700000002" -> null

```

</details>

*Pushed by: @jonyeezs*